{
  "experiences": [
    {
      "id": 1,
      "title": "Full-Stack Developer (Web, Backend, Mobile App)",
      "company": "Syskita Development",
      "location": "Indonesia",
      "period": "Aug 2024 - Present",
      "type": "Freelance",
      "description": "Led end-to-end development of integrated systems and mobile applications for MERQ, specializing in logistics and merchandising solutions. Architected scalable full-stack solutions delivering seamless user experiences across web, backend services, and mobile platforms.",
      "achievements": [
        "Architected and deployed full-stack logistics platform serving 50+ merchandising teams",
        "Designed microservices backend infrastructure reducing API response time by 45%",
        "Developed feature-rich React Native mobile app with offline-first capabilities for field operations",
        "Implemented real-time tracking and inventory management systems improving operational efficiency by 35%",
        "Managed cloud infrastructure using DigitalOcean with automated deployment pipelines",
        "Integrated Firebase for push notifications and real-time data synchronization across platforms"
      ],
      "technologies": ["React Native", "React.js", "TypeScript", "Go-Lang", "PostgreSQL", "Firebase", "Redis", "Amazon S3", "DigitalOcean", "REST API"]
    },
    {
      "id": 2,
      "title": "Mobile Engineer & DevOps (Mobile-First Development)",
      "company": "Ponpes Mobile (Lanikea Digital)",
      "location": "Indonesia",
      "period": "Jan 2024 - Present",
      "type": "Freelance",
      "description": "Spearheading mobile-first development for Ponpes Mobile, a comprehensive platform serving Islamic boarding school communities. Specialized in React Native architecture with integrated AI-Agent capabilities and optimized DevOps practices for mobile deployment.",
      "achievements": [
        "Architected mobile-first React Native application serving 1000+ active users across multiple Islamic boarding schools",
        "Implemented AI-Agent integration enabling intelligent task automation and personalized recommendations",
        "Optimized React Native performance achieving 60% faster app load times and reduced memory consumption",
        "Established CI/CD pipeline using Firebase and S3 for seamless mobile app distribution",
        "Implemented real-time synchronization using Redis for offline-capable features",
        "Led architectural decisions for scalable backend infrastructure supporting growing user base"
      ],
      "technologies": ["React Native", "React.js", "TypeScript", "AI-Agent", "Firebase", "Redis", "Amazon S3", "DevOps", "REST API"]
    },
    {
      "id": 3,
      "title": "React Native Developer",
      "company": "Aleph-Labs",
      "location": "Jakarta, Indonesia",
      "period": "Jun 2019 - Present",
      "type": "Full-time",
      "description": "Served as a software developer and technical consultant for strategic enterprise clients, translating business requirements into high-performance mobile and web applications.",
      "achievements": [
        "Ensured code stability across 26 cross-platform mobile applications for Astra Honda dealers",
        "Boosted PermataBank web app performance by ~40% through optimization and new codebase standards",
        "Established coding standards for by.U mobile app, increasing team development efficiency by 30%",
        "Optimized core features achieving ~30% increase in application performance",
        "Delivered full-cycle development for Multiple Payment, Order Topping/Package, FAQ, Referral Program",
        "Contributed to by.U website and CMS development, accelerating CMS-side development by ~10%"
      ],
      "technologies": ["React Native", "React.js", "Redux", "TypeScript", "JavaScript", "REST API", "Firebase"]
    },
    {
      "id": 4,
      "title": "Senior Software Engineer",
      "company": "PT Karya Inovasi Digital",
      "location": "Tangerang, Indonesia",
      "period": "Sep 2024 - Jan 2025",
      "type": "Freelance",
      "description": "Served as a lead developer and technical consultant for multiple educational information system projects.",
      "achievements": [
        "Improved communication between frontend and backend teams, accelerating development by 50%",
        "Optimized mobile app codebase boosting user experience by 40%",
        "Implemented reusable components and Tanstack Query, resulting in 60% performance increase",
        "Refactored spaghetti code increasing overall application performance by 50%",
        "Initiated Live Attendance feature using camera and location services",
        "Mentored junior developers leading to 60% increase in team development efficiency"
      ],
      "technologies": ["React Native", "React.js", "TypeScript", "Tanstack Query", "RFID", "Voice Recognition", "AI"]
    },
    {
      "id": 5,
      "title": "Full-Stack Software Engineer",
      "company": "PT Cahaya Sanivokasi",
      "location": "Tangerang, Indonesia",
      "period": "Sep 2024 - Jan 2025",
      "type": "Freelance",
      "description": "Responsible for the development, maintenance, and modernization of the company's internal Human Resource Information System (HRIS).",
      "achievements": [
        "Led complete redesign migrating legacy system to modern React stack with Shadcn UI",
        "Optimized user navigation flows resulting in 40% improvement in user experience",
        "Established development standards accelerating development cycle by 30%",
        "Led technological transformation achieving 40% gain in operational efficiency",
        "Mentored engineers to foster culture of ownership and higher quality standards"
      ],
      "technologies": ["React.js", "TypeScript", "ShadcnUI", "TailwindCSS", "Microservices", "Docker", "Hono"]
    },
    {
      "id": 6,
      "title": "Senior Front-End Engineer",
      "company": "PT Hudoro Solusi Digital",
      "location": "Tangerang, Indonesia",
      "period": "Mar 2024 - May 2024",
      "type": "Freelance",
      "description": "Deployed as a lead front-end consultant for TUV Nord Indonesia, tasked with technological transformation of multiple legacy internal applications.",
      "achievements": [
        "Architected unified front-end architecture accelerating development cycle by 60%",
        "Built centralized design system improving user experience by 30%",
        "Overhauled REST API handling reducing server load by 35% and boosting performance by 20%",
        "Improved communication workflow between backend and frontend teams",
        "Mentored engineers on design system implementation and standardized Git workflows"
      ],
      "technologies": ["React.js", "TypeScript", "Design Systems", "REST API", "Git", "Unit Testing"]
    },
    {
      "id": 7,
      "title": "API Engineer",
      "company": "PT Sharing Vision Indonesia (Bank Rakyat Indonesia / BRI)",
      "location": "Jakarta, Indonesia",
      "period": "Jun 2021 - Sep 2023",
      "type": "Remote",
      "description": "Served as API Engineer at BRI's BRIAPI division, architecting and developing microservices for digital banking transformation and Open API ecosystem. Collaborated with backend teams to deliver production-grade banking APIs serving millions of transactions.",
      "achievements": [
        "Architected and implemented 15+ microservices for core banking features using Go and Python",
        "Developed critical payment features: Salary Crediting, OTP SMS Payment, User Authentication, Account Inquiry, Fund Transfers",
        "Managed API Gateway policies using Apigee, ensuring 99.99% uptime for Open API platform",
        "Performed comprehensive end-to-end testing and deployment automation using Jenkins and Kubernetes",
        "Established microservice architecture standards reducing API response time by 40%",
        "Collaborated with cross-functional teams for digital banking transformation initiatives"
      ],
      "technologies": ["Go", "Python", "Microservices", "Jenkins", "Kubernetes", "Apigee", "API Gateway", "REST API", "Docker"]
    },
    {
      "id": 8,
      "title": "Web Developer",
      "company": "The Entrepreneurs Society",
      "location": "Jakarta, Indonesia",
      "period": "Aug 2021 - Mar 2023",
      "type": "Freelance",
      "description": "Led a major overhaul of ELITES.ID, a premium e-course web platform for an entrepreneurship community.",
      "achievements": [
        "Led complete front-end overhaul boosting performance and UX by 25%",
        "Established coding standards increasing team work efficiency by 20%",
        "Optimized admin dashboard improving admin-side efficiency and UX by 20%",
        "Implemented compression methods reducing server and website load by 15%",
        "Refactored codebase with latest React.js technologies"
      ],
      "technologies": ["React.js", "JavaScript", "Performance Optimization", "Admin Dashboard", "Image Compression"]
    },
    {
      "id": 9,
      "title": "Co-Founder | CTO | Software Engineer",
      "company": "Kabayan Coding",
      "location": "Tangerang, Indonesia",
      "period": "Aug 2019 - Jun 2022",
      "type": "Freelance",
      "description": "Co-founded and served as CTO for Kabayan Coding, a developer community focused on freelance projects, collaboration, and mentorship.",
      "achievements": [
        "Designed e-commerce architecture and initiated mobile app, web app, and admin dashboard development",
        "Optimized cross-functional workflow boosting development efficiency by 30%",
        "Increased cross-platform application performance by ~20% through optimization techniques",
        "Led code reviews and API contract audits improving overall UX by 30%",
        "Developed PTSP public service website improving web performance by 20%",
        "Acted as lead mentor during community meetups educating aspiring programmers"
      ],
      "technologies": ["React Native", "React.js", "Laravel", "Redux", "Rollup.js", "REST API", "Firebase"]
    },
    {
      "id": 10,
      "title": "Front-End Developer",
      "company": "PT Mitra Digital Sukses (Youtap)",
      "location": "Jakarta, Indonesia",
      "period": "Oct 2021 - Apr 2022",
      "type": "Freelance",
      "description": "Developed a specialized web dashboard for the internal finance team to streamline and automate data reconciliation between merchants and Youtap's POS system.",
      "achievements": [
        "Designed architecture and initiated admin dashboard with modern, clean code structure",
        "Implemented GraphQL increasing data transfer efficiency and API call logic by 10%",
        "Optimized React components using Atomic Design accelerating development workflow by 15%",
        "Developed crucial features boosting finance team operational efficiency by 20%",
        "Managed full development lifecycle from testing to deployment and user training"
      ],
      "technologies": ["React.js", "GraphQL", "Atomic Design", "Redux", "Memoization", "Dashboard Development"]
    },
    {
      "id": 11,
      "title": "Full-Stack Developer",
      "company": "PT Gaia Persada",
      "location": "Jakarta, Indonesia",
      "period": "Nov 2018 - Apr 2019",
      "type": "Full-time",
      "description": "Served as a full-stack developer and technical consultant at a software house, focusing on developing digital solutions for the education sector.",
      "achievements": [
        "Established development standards for school website and admin dashboard",
        "Optimized UI codebase with modern JavaScript boosting website performance by 10%",
        "Led implementation of new UI/UX design to modernize platform look and feel",
        "Refactored existing features increasing overall website stability by 20%",
        "Architected React Native mobile application with cross-platform capability",
        "Implemented core features: authentication, loyalty dashboard, point redemption, referral system"
      ],
      "technologies": ["React Native", "React.js", "JavaScript", "WordPress", "Mobile Development", "UI/UX"]
    },
    {
      "id": 12,
      "title": "Junior Front-End Developer",
      "company": "Nineod",
      "location": "Cimahi, Indonesia",
      "period": "Feb 2018 - Nov 2018",
      "type": "Full-time",
      "description": "Responsible for developing and managing various front-end focused client projects.",
      "achievements": [
        "Contributed to front-end development for Lifeyo.com website builder platform",
        "Performed fixes and customizations on various WordPress templates",
        "Met specific needs of multiple clients through template customization",
        "Gained experience in client project management and requirements gathering",
        "Developed skills in WordPress development and front-end optimization"
      ],
      "technologies": ["WordPress", "HTML", "CSS", "JavaScript", "Template Customization", "Client Projects"]
    }
  ]
}
